/*****************************************************************************
  * @file:    	debug.c
  * @author:  	louiswoo
  * @version: 	V1.0
  * @date:	2020-6-6
  * @brief:	调试模块，主要调用串口进行调试信息的输出
	包括字符串输出和 unsigned int型2字节的变量输出
*******************************************************************************/
#include "config.h"
#include "debug.h"
#include "usart.h"

/****************************************************************************************
  * @brief:	发送一个u16变量
	* @param:	var: u16变量
  * @retval:	none
*****************************************************************************************/
void DebugVar(u16 var)
{
	u8 num[6];
	num[0]=var/10000+'0';
	num[1]=var%10000/1000+'0';
	num[2]=var%1000/100+'0';
	num[3]=var%100/10+'0';
	num[4]=var%10+'0';
	num[5]='\0';
	debug(num);
}
void DebugVIP(u8 *str)
{
	debug("***");	
	debug(str);
	debug("\r\n");
}